{
  "en": "On the other hand, we denounce with righteous indignation and dislike men who are so beguiled and demoralized by the charms of pleasure of the moment, so blinded by desire, that they cannot foresee the pain and trouble that are bound to ensue; and equal blame belongs to those who fail in their duty through weakness of will, which is the same as saying through shrinking from toil and pain. \n\nThese cases are perfectly simple and easy to distinguish. In a free hour, when our power of choice is untrammelled and when nothing prevents our being able to do what we like best, every pleasure is to be welcomed and every pain avoided. But in certain circumstances and owing to the claims of duty or the obligations of business it will frequently occur that pleasures have to be repudiated and annoyances accepted. \n\nThe wise man therefore always holds in these matters to this principle of selection: he rejects pleasures to secure other greater pleasures, or else he endures pains to avoid worse pains.",
  "vi": "Mặt khác, chúng tôi tố cáo với sự phẫn nộ chính đáng và không thích những người bị mê hoặc và mất tinh thần bởi sự quyến rũ của thú vui nhất thời, mù quáng bởi ham muốn đến mức họ không thể thấy trước nỗi đau và rắc rối sắp xảy ra sau đó; và sự đổ lỗi tương đương thuộc về những người thất bại trong nhiệm vụ của mình do yếu kém về ý chí, điều này cũng giống như nói rằng do chùn bước trước sự vất vả và đau đớn. \n\nNhững trường hợp này hoàn toàn đơn giản và dễ phân biệt. Trong giờ phút rảnh rỗi, khi khả năng lựa chọn của chúng ta không bị cản trở và khi không có gì ngăn cản chúng ta có thể làm điều mình thích nhất, thì mọi niềm vui đều được đón nhận và mọi nỗi đau đều có thể tránh được. Nhưng trong một số trường hợp nhất định và do các yêu cầu về nghĩa vụ hoặc nghĩa vụ kinh doanh, thường xảy ra trường hợp niềm vui phải bị từ chối và những khó chịu phải chấp nhận. \n\nDo đó, người khôn ngoan luôn tuân thủ nguyên tắc lựa chọn này trong những vấn đề này: anh ta từ chối những thú vui để đảm bảo những thú vui khác lớn hơn, hoặc nếu không thì anh ta chịu đựng nỗi đau để tránh những nỗi đau tồi tệ hơn."
}
