[
  {
    "address": "8 The Green, Suite ",
    "ava": "https://media.licdn.com/dms/image/C4E0BAQFFhgqQNtxH4w/company-logo_200_200/0/1631317566532?e=2147483647&v=beta&t=w94beWOova_Q_UmSNo_8N-V6T1PsVLJBZmSA9Ak8rrY",
    "country": "United States",
    "description": "International Trade Finance (ITF) provides a comprehensive approach to structure complex financial transactions for a variety of stakeholders, including importers and exporters, commodity traders, freight-forwarders, multinational institutions and private investors. Our experienced team understands that to execute trade finance transactions in today’s volatile global markets demands creativity and flexibility. As such, ITF utilizes an array of trade and export finance instruments to mitigate unnecessary credit risks while increasing clients’ access to working capital. While we provide specialized supply chain finance arrangements as a deal dictates, our general services typically fall into one of the following four (4) categories:\n\nDocumentary Letters of Credit;\nStandby Letters of Credit;\nBank Guarantees; and\nSWIFT Services.\n\nIn keeping with ITF’s mission statement, our team tailors each instrument to the meet the requirements of each transaction. By providing the highest quality services to our partners, ITF maintains an unparalleled reputation among the international trade community.\n\nAfter becoming a partner, our team at ITF will guide you through the early stages of your deal, until the transaction is finalized.\n\ncontact us \ninfo@intltradefinance.com\n\n",
    "employeeCount": 7,
    "id": "international-trade-finance-llc",
    "industry": "Wholesale Import and Export",
    "name": "International Trade Finance, LLC",
    "searchQueries": ["Tea importers and distributors in Germany"],
    "url": "http://www.intltradefinance.com"
  },
  {
    "address": "111 River Street",
    "ava": "https://media.licdn.com/dms/image/C4E0BAQGb1k-qR_0htQ/company-logo_200_200/0/1635353082346/interamerican_coffee_logo?e=2147483647&v=beta&t=M6DcEaFPdz-uaEANfVdOsHgLSmHnVStwimtHymAgRs0",
    "country": "United States",
    "description": "Since 1983, InterAmerican has been supplying specialty green coffee to roasters across North America.\n\nThrough our 40+ sister companies in 27 countries, as well as through old and new relationships that we consistently seek out, nurture and forge, we source and import some of the world’s best coffees. These include certified Organic, Fair Trade and Rainforest Alliance coffees, quality and price options from traceable blend components to unique small-lot offerings, and coffees through special projects designed to improve both cup quality and the lives and futures of coffee growers and producers.\n\nOur headquarters is in Hoboken, N.J., and we additionally have Trading teams and Quality Control labs in Providence, Houston and San Diego. And proudly, we’re ­­­part of the Neumann Kaffee Gruppe (NKG)—the world’s leading green coffee company—which gives us access to numerous other quality-control labs and on-the-ground experts around the globe.\n\nNKG’s global breadth and strength help us to consistently acquire the coffees our customers love—and to keep discovering beautiful new ones. Our decades of experience have refined and strengthened our logistics operations. And the expertise and passion our teams bring to work each day help us to positively impact the supply chain, both locally and globally. Together, these factors make for a company we couldn’t be prouder of.\n\nWe invite you to cup with us, train with us and explore with us. And to share how we can help you to keep growing along with us.",
    "employeeCount": 34,
    "id": "interamerican-coffee",
    "industry": "Import & Export",
    "name": "InterAmerican Coffee",
    "searchQueries": [
      "Tea importers and distributors in Germany",
      "German coffee brands list",
      "German coffee producers",
      "Coffee bean importers Germany",
      "Roasted coffee suppliers in Germany",
      "Sustainable coffee sourcing companies in Germany",
      "German coffee bean suppliers",
      "Coffee exporters from Germany",
      "Wholesale coffee suppliers in Germany",
      "German coffee industry suppliers",
      "German coffee producers and distributors",
      "Importers of coffee in Germany",
      "Coffee importers in Germany",
      "Coffee bean importers in Germany",
      "Leading coffee brands in Germany",
      "Coffee roasters in Germany",
      "Coffee roasteries in Germany",
      "Companies specializing in coffee roasting in Germany",
      "German coffee bean producers",
      "Roastery companies in Germany",
      "Manufacturers of coffee equipment in Germany",
      "Coffee production companies in Germany",
      "Specialty coffee roasters in Germany",
      "Coffee market in Germany",
      "Coffee equipment suppliers in Germany",
      "Specialty coffee retailers in Germany",
      "German coffee export companies",
      "German coffee companies producers",
      "German coffee bean importers",
      "German coffee industry companies",
      "Coffee processing companies in Germany",
      "Sustainable coffee initiatives in Germany"
    ],
    "url": "http://www.interamericancoffee.com"
  },
  {
    "address": "9900 SW 107 Ave",
    "ava": "https://media.licdn.com/dms/image/C4E0BAQFExlH_3WJQeQ/company-logo_200_200/0/1630617168434/consortiumwines_logo?e=2147483647&v=beta&t=kJzYOoJUb8GDKPYbnYD8vUXCqI84FYXqpmyRXfsG76E",
    "country": "United States",
    "description": "Our dedication lies in sourcing the best quality wines from around the world that speak to us through the vineyard, people, region, and what we sense in the bottle. We strive to provide the best quality with in every region we operate, along with the respect to best winery practices. We hope to one day be associated with the greatest importers and distributors, so that when they see Consortium Wine and Spirits on a label, they will immediately associate it with quality. From vineyard to warehouse, we use the highest standard in transportation and storage, preserving is as important as producing, so that when our customers and their guests enjoy our bottle of wine, they are assured that the wine will arrive in the best condition possible. These practices are done to not only provide the best customer service to our customers, but most importantly to our winery partners.",
    "employeeCount": 17,
    "id": "consortiumwines",
    "industry": "Beverage Manufacturing",
    "name": "Consortium Wine and Spirits",
    "searchQueries": ["Tea importers and distributors in Germany"],
    "url": "http://www.consortiumwines.com"
  },
  {
    "address": null,
    "ava": "https://media.licdn.com/dms/image/C4E0BAQFbbG45sc-DMQ/company-logo_200_200/0/1631350650986?e=2147483647&v=beta&t=7GYChE57H3Q2Q6YWNUQsEpLEAp-OtArgOblQxKM94DM",
    "country": "United States",
    "description": "POOLCORP is the world's leading wholesale distributor of swimming pool equipment, parts and supplies, and related outdoor living products. The company operates over 370 locations worldwide with more than 4,000 employees through three primary distribution networks: SCP Distributors LLC, Superior Pool Products LLC, and Horizon Distributors Inc. Our Sales Centers each operate with full profit and loss responsibility, giving our organization an entrepreneurial spirit.\n\nWith Sales Centers located across North America (US, Canada, and Mexico), Europe (France, UK, Spain, Portugal, Italy, Belgium, Germany, and Croatia), South America (Colombia), and Australia, we distribute a broad range of products to roughly 120,000 customers around the world, serving four principal markets:\n\nRemodelers and builders installing new swimming pools and refurbishing existing pools\nIndependent specialty retail stores selling outdoor living products to consumers\nService companies performing pool and hot tub maintenance and repair\nContractors serving in the irrigation and landscape maintenance markets\nPOOLCORP’s Sales Center networks distribute non-discretionary pool maintenance products such as chemicals and replacement parts; discretionary products such as packaged pool kits, whole goods, irrigation and landscape products, including a complete line of commercial and residential irrigation products and parts, power equipment for the professional landscape market; specialty products such as outdoor lighting, grills, and outdoor kitchen components; as well as golf irrigation and water management products.",
    "employeeCount": 820,
    "id": "scp-spp",
    "industry": "Wholesale",
    "name": "SCP Distributors/ Superior Pool Products",
    "searchQueries": ["Tea importers and distributors in Germany", "Tea wholesalers in Germany"],
    "url": "http://www.poolcorp.com"
  },
  {
    "address": null,
    "ava": "https://media.licdn.com/dms/image/C4D0BAQH6gQ6momsSCQ/company-logo_200_200/0/1631322564696?e=2147483647&v=beta&t=M8F50mJrkS9YByigJiJHD-cTy00EIZTyr2QPh64Ea0k",
    "country": "Brazil",
    "description": "Tropical Group , we are Producer, Exporter / Supplier of Tropical hard wood from South and Central America and Africa , we also deal with wood and wood Products from North America , Europe and Asia such as decks , Floors, Sawn Timber , Profile Timber , Marine Timber , Round & Squares logs , Shingles Roof , Wood chips and Pellets , Pallets Lumber , Doors , Furniture and all other wood products , we also into International trading in Wood and Wood Products , Building Materials, etc We have offices in Guyana , Brazil ,Hong Kong , India , Africa an Marketing agents/ base in Suriname , UK , Germany , Belgium , Spain , Poland , Ukraine, China , USA, Chile , Philippines, Vietnam etc .We are also have office coming soon to the middle East , and Europe . We also Export Granite Slab , Blocks and Tiles from Brazil\nWe just add our STEEL & METAL -DIVISION of which our USA and UK offices will handle we deal with all steel & metal products like Coils ( all grades) Wire Rod , Plates , H Beams, Channel, etc ",
    "employeeCount": 6,
    "id": "tropicalgroup",
    "industry": "International Trade and Development",
    "name": "Tropical Group",
    "searchQueries": ["Tea importers and distributors in Germany"],
    "url": "http://www.tropicalwoodsinter.com"
  },
  {
    "address": "9750 W Skye Canyon Park Dr",
    "ava": "https://media.licdn.com/dms/image/D4D0BAQHGE6iI01YzUg/company-logo_200_200/0/1694102805599/hofbrauhaus_usa_logo?e=2147483647&v=beta&t=OXheKYlQevVWzg33YhGuShR2ejivyS5R7u7Xn_1EuPY",
    "country": "United States",
    "description": "The Brand. The Brew. The Legend.\nThe world-famous Hofbräuhaus brand brings an unparalleled beer culture to the world. A great variety of the exceptional Hofbräu beers are imported from Germany and offered to the beer lovers in the USA.",
    "employeeCount": 18,
    "id": "hofbrauhaus-usa",
    "industry": "Import & Export",
    "name": "Hofbräuhaus of America - Beer Import",
    "searchQueries": ["Tea importers and distributors in Germany"],
    "url": "http://www.hofbrauhausimport.us/"
  },
  {
    "address": null,
    "ava": null,
    "country": "Türkiye",
    "description": "ARTEK METAL Industry & Trade Co. Ltd. is one of the top glass importers of Turkey.\r\nOur company consists of several companies that are having business in glass importing, \r\nglass processing, warehousing, bonded warehousing.\r\n\r\nWe are importing glass over 25 years. The firm has become a brand in the domestic and overseas markets with its quality service, suitable price, customer relations based on long-standing friendship, and honest trading.\r\n\r\nAs a float glass importer in Turkey and we are working with world wide known factories like Asahi, Guardian, Pilkington, Saratov, Taiwan Glass. (alphabetically ordered)\r\n\r\nWe are agent of Taiwan Glass for Turkey and Bulgaria market. \r\n\r\nWe import from all over the world: Germany, England, Luxemburg, Taiwan, India, Russia, Romania, Ukraine, Belgium, China, Iran, Bulgaria, Israel, Czech Republic. \r\n\r\nOur warehouse with 8.000 m2 covered area is established on a 15.000 m2 land plot and all of our imports and merchandise distribution are made from our head office located in Istanbul.\r\n\r\nThere are three cranes in our warehouse. Our loadings are made safely with our professional team.\r\n\r\nAlso in Izmir city we have 22.000m2 covered area that is making glass processing in the name of Dost Cam.\r\n\r\nAll type of glass processing is taking place excluding automobile glass in this facility. \r\n\r\nEvery ancillary industries about glass processing is serviced in this factory like tempered, laminated, side covering, double glazing, decorative glass making etc. It is top glass processer in Izmir with its machine park. It has over 500 customer references. \r\n\r\nIn Gebze 22000m2 area is under construction which is expected to completed end of 2010 that is going to be Istanbul branch for glass processing. All land areas belonging to our company.",
    "employeeCount": 10,
    "id": "artek-metal-san.-tic.-ltd.-sti.",
    "industry": "Wholesale Building Materials",
    "name": "Artek Metal San. Tic. Ltd. Sti.",
    "searchQueries": ["Tea importers and distributors in Germany"],
    "url": "http://www.artekmetal.com"
  },
  {
    "address": "12201 Merit Dr",
    "ava": "https://media.licdn.com/dms/image/C4D0BAQFZzNBJ0tWlkg/company-logo_200_200/0/1631370985276?e=2147483647&v=beta&t=vTujOvHG34G8tf1wVkDDB8MWmbC7GdlZVUSGJnJe9sc",
    "country": "United States",
    "description": "Brioche Dorée is a French chain of Bakery/Café restaurants founded in 1976 and originally started in Brest. The company was founded by Louis Le Duff, current president of Groupe Le Duff. The chain has worldwide operations and is the second largest Bakery/Café chain in the world. It serves over 300,000 customers every day and operates over 550 restaurants. The name means \"Golden Brioche\"​ in French.\n\nBrioche Dorée North America currently has 32 locations in North America: 17 in the United States and 15 in Canada.\n\nThe company also has operations in the Switzerland, Luxembourg, Algeria, Costa Rica, Czech Republic, Denmark, United Kingdom, Germany, Argentina, Morocco, Saudi Arabia, Syria, China, South Korea, Japan, UAE, Oman, Kuwait, Qatar and Bahrain.\n\n",
    "employeeCount": 3,
    "id": "brioche-doree-north-america",
    "industry": "Restaurants",
    "name": "Brioche Dorée North America",
    "searchQueries": [
      "Tea importers and distributors in Germany",
      "Importers of coffee in Germany",
      "Coffee importers in Germany"
    ],
    "url": "https://briochedoree.us/en/"
  },
  {
    "address": "15501 Texaco Avenue",
    "ava": "https://media.licdn.com/dms/image/C560BAQFkrujhnjapcA/company-logo_200_200/0/1630606087909/rinkens_international_logo?e=2147483647&v=beta&t=wbwVgXk0UYloZSSxawry-9f0Oto4AR3xzV_JOPRaBKc",
    "country": "United States",
    "description": "We have already set the industry standard for international containerized auto shipping. Now, our mission is to continue to innovate and disrupt the old ways of doing things while maintaining and inspiring company culture, and providing our customers with the industry’s highest level of quality and service. We operate like a startup - thinking creatively, quickly and deploying solutions rapidly, around the globe. In recognition of our efforts, in 2019 we received the Automotive Logistics Magazine’s prestigious Transport Innovation award. \n\nOur core business includes transporting cars in containers globally and domestically using the revolutionary “R-Rak” loading system. Within the automotive space, we work with:\n\n- Car manufacturers (OEMs)\n- Rental car companies\n- Fleet owners and operators\n- Large dealers and importers\n- Classic car dealers\n\nWe also work with hundreds of shippers of other goods - including boats, spas, household goods, and other non-perishables. We can ship almost anything, anywhere!\n\nOur offices are located around the United States, Germany and China. Our shipping specialists are standing by to answer any questions you may have. Give us a call, live chat with us on our website or shoot us an email at sales@cfrrinkens.com, or visit our website www.cfrrinkens.com for more information.",
    "employeeCount": 91,
    "id": "cfrrinkens",
    "industry": "Import & Export",
    "name": "CFR Rinkens LLC",
    "searchQueries": ["Tea importers and distributors in Germany"],
    "url": "http://www.cfrlogistics.com"
  },
  {
    "address": "5454 E. Washington Street",
    "ava": "https://media.licdn.com/dms/image/C560BAQGpplwWmfDquw/company-logo_200_200/0/1630639637463/bumkins_logo?e=2147483647&v=beta&t=vvlMp5iWsi1fcD8Z2GdQ8iWDsYDsz_HICXmwHyUrzhc",
    "country": "United States",
    "description": "Bumkins was founded on a working mother’s need for safer and sustainable baby products. Since 1989, we've been creating fun, functional and stylish family-friendly products we can all feel good about. Based in Phoenix, Arizona, our products feature fun, original prints, along with those from licenses like Disney, DC Comics (Batman, Superman, Wonder Woman, The Flash), Nintendo, Sanrio's Hello Kitty, and The Wizarding World of Harry Potter.",
    "employeeCount": 35,
    "id": "bumkins",
    "industry": "Consumer Goods",
    "name": "Bumkins",
    "searchQueries": ["Tea importers and distributors in Germany"],
    "url": "http://www.bumkins.com"
  },
  {
    "address": "519 South Ellwood Ave",
    "ava": "https://media.licdn.com/dms/image/C4E0BAQGMw6CBll_eoQ/company-logo_200_200/0/1631332113315?e=2147483647&v=beta&t=MqcLaThtbpRiO70-2D-VWMVyPBfLdoMwVt7BLIOsRjI",
    "country": "United States",
    "description": "Customs broker & freight forwarder dedicated to building long-lasting, successful partnerships with our clients. \n\nFollow us for weekly content on key supply chain updates, best practices for importers and exporters, and occasional company news. \n\nCheck out our website for more details on the services we offer, and how to get in touch with us! ",
    "employeeCount": 40,
    "id": "c-j-international-inc.",
    "industry": "Transportation, Logistics, Supply Chain and Storage",
    "name": "C J International",
    "searchQueries": ["Tea importers and distributors in Germany"],
    "url": "http://www.cjinternational.com/"
  },
  {
    "address": "6692 W Shannon St",
    "ava": "https://media.licdn.com/dms/image/C560BAQF_BCvUjpO6rw/company-logo_200_200/0/1672437636544?e=2147483647&v=beta&t=VqSFywbYCSyRlg8r1ImplWXAeWlGmaYhpyjHCB9bXUM",
    "country": "United States",
    "description": "Thank you for visiting our LinkedIn Page !\n\n🍀 About Us: \nVstorks is a trusted exporter of Wood & Wicker Furniture, Water Hyacinths, Wood Deck Tiles, and Handicrafts. In 2018, Vstorks (Outdoor Furniture and Handicrafts Supplier) was founded by a dynamic and young team with the mission is to provide high-quality products from our most trusted Vietnamese manufacturers and traditional craft villages to wholesales importers around the world at competitive prices. By this way, we could bring more jobs for Vietnamese farmers as well as improve their lives. Let's be with me to make dreams come true!\n\n🍀 Our Products\nVstorks currently focuses on four main categories including Wicker Furniture, Wooden Furniture, Water Hyacinth, and Rattan & Bamboo Handicrafts. In addition, we provide customized designs to suit your merchandise plans. Recently, we added \"Flooring Deck Tiles\" as the newest product in our ecosystem. \n\nOur home and décor products have been exported to over 20 countries and regions in America, Europe, Australia, and Southeast Asia. As an international company with offices in the U.S. and Vietnam, our dedicated staff of professionals is ready to provide product information and respond to your requests effectively and quickly. \n\n🍀 Core Values:\n Vstorks (standing for Vietnamese Storks like the nursey fable of magical birds who deliver precious goods) who are obsessed with bringing high-quality, village-style rattan items and wooden products made in Vietnam to the global marketplace and consumers.\nOur company values have driven our decisions and operations since day one, and we are incredibly proud to deliver high quality products and excellent service. As we continue to serve our customers and work to build a trusted company, it’s equally important that we consistently deliver on our commitments. \n\n-----------------\nEmail: support@vstorks.com\nWhatsApp: (+1) 615-625-6666\n\n🌹 Keep in touch by following us for more updated and promotions 🌹",
    "employeeCount": 2,
    "id": "vstorks",
    "industry": "Wholesale Furniture and Home Furnishings",
    "name": "VStorks (Outdoor Furniture Supplier & More)",
    "searchQueries": [
      "Tea importers and distributors in Germany",
      "Coffee importers in Europe",
      "Wholesale coffee suppliers in Germany",
      "Importers of coffee in Germany",
      "Coffee importers in Germany",
      "Top coffee importers in Germany",
      "Tea wholesalers in Germany"
    ],
    "url": "https://www.vstorks.com"
  },
  {
    "address": "Premstätter Straße 165",
    "ava": "https://media.licdn.com/dms/image/C4D0BAQFpinq8Fy7IHQ/company-logo_200_200/0/1630470459882/activeit_software_consulting_gmbh_logo?e=2147483647&v=beta&t=YwylLwdz7ICFAdr3w3I_VYmWvvcHGr1q099AzwqKheY",
    "country": "Austria",
    "description": "We are experts when it comes to powerful software solutions for food producing companies. Whether vegetables, cheese, exotic fruits and more – our customers benefit from products specially adapted to their needs – individual and tailor-made!\n\nMaximum efficiency on all production lines is your biggest concern?\nOur production control \"PECS\" takes over the central administration and control of your plants, as well as the time recording of your staff and provides extensive evaluations!\n\nYour import planner is absent due to illness?\n\"FIPS\", our planning software for ripening control, transport and ordering, prevents sources of error that are often not taken into account in day-to-day business.\n\nDo you prefer to handle goods acceptance & quality assessments on your smartphone?\nOur mobile \"GO!\" solutions are where you are - at any time!\n\nWould you like to have all information about your company live and clearly at hand?\nWith our \"LiveApp\" you get a real-time overview of all processes and procedures, for example to be able to react promptly to delays or incidents! \n\nRecognizing inefficiencies or cross-product evaluations are important to you?\nWith \"BI\" (Business Intelligence), you can now analyze the large amount of data that your company collects every day in no time at all, even live and mobile on your production database!\n\nDo you recognize yourself in one of the scenarios?\nThen let our expertise and experience convince you in a non-binding conversation.",
    "employeeCount": 11,
    "id": "activeit-software-consulting-gmbh",
    "industry": "Software Development",
    "name": "activeIT Software & Consulting GmbH",
    "searchQueries": ["Tea importers and distributors in Germany"],
    "url": "http://www.active-it.at"
  },
  {
    "address": null,
    "ava": "https://media.licdn.com/dms/image/C4D0BAQEpCbdF673lmQ/company-logo_200_200/0/1630493495167?e=2147483647&v=beta&t=CoUE4r1XJ71gwndGcEjroBM9IKacqbL621uKMXNSu7A",
    "country": "United States",
    "description": "Servicing wine lovers with unique, rare, hard to find, and high value wines at incredible prices - a specially curated selection by wine consultant and expert, Ian Blackburn\n\nFree delivery with any order of $50+ in California. We ship nationwide!",
    "employeeCount": 4,
    "id": "merchantofwine",
    "industry": "Beverage Manufacturing",
    "name": "Merchant of Wine",
    "searchQueries": ["Tea importers and distributors in Germany"],
    "url": "http://www.merchantofwine.com"
  },
  {
    "address": "1672 E 233rd St",
    "ava": "https://media.licdn.com/dms/image/D4E0BAQEG61D1p0-KdQ/company-logo_200_200/0/1706817449510/dja_imports_ltd_logo?e=2147483647&v=beta&t=2b_ktHTa_8Y_QTnA2iFOQssY1tKLQoA_Vag596P57-I",
    "country": "United States",
    "description": "D.J.A. Imports, where innovation, quality, and service meet. D.J.A. is proud to be the trendsetter in distinctive ornamental architectural steel designs, and a trailblazer in supplying cantilever gate systems for sliding gates and doors, overhead, bi-fold, telescopic gate and door hardware.\n\nWe invite you to visit our website www.DJAImports.com and look forward to discussing how we can best support your next project. Call us at 718-324-6871, email info@DJAImports.com.",
    "employeeCount": 2,
    "id": "dja-imports-ltd",
    "industry": "Building Materials",
    "name": "D.J.A. Imports, Ltd",
    "searchQueries": ["Tea importers and distributors in Germany"],
    "url": "https://djaimports.com"
  },
  {
    "address": "Two Jericho Plaza",
    "ava": "https://media.licdn.com/dms/image/C560BAQH9oavr-UaYAw/company-logo_200_200/0/1630592525883/bamberger_polymers_logo?e=2147483647&v=beta&t=rpo63CG3iHAEnTgz-NiEjr8tBncrJB3w-iPyh-WeEgI",
    "country": "United States",
    "description": "WHO WE ARE\nFounded in 1967, & celebrating over 50 years of outstanding service to the plastics industry, Bamberger Polymers markets a full range of thermoplastic resins through our network of sales offices & distribution centers. \n\nBamberger markets around the globe with representatives dedicated to all major markets in North America, South America, Europe, the Middle East, Africa, Asia, & the Pacific Rim. \n\nEvery year we deliver more than 1 billions pounds of bulk & packaged resins to custom & proprietary manufacturers of plastic products, injection molders, blow molders, compounders & extruders. \n\nBamberger offers branded prime, generic prime, & wide-spec resins, including low-density polyethylene, linear low-density polyethylene, high-density polyethylene, polypropylene, PET, polystyrene & engineering thermoplastics. \n\nOUR MISSION\nBamberger Polymers distributes high quality prime-spec & wide-spec plastic resins to customers worldwide. Our success is predicated on providing the right product at the right price at the right time. \n\nOUR VISION\nBamberger Polymers seeks to continue to build upon its history of success & become the world's most trusted name in plastic resin distribution. We aim to be trusted advisors to our customers & suppliers. Our customer service, support & our ability to consistently provide high quality products should be the mark by which all other business in our market segment are measured. \n\nOUR VALUES\nWhile priorities & objectives may change, our core values do not. \n\n- Integrity: We are honest & ethical in each & every transaction. \n- Diligence: We are conscientious, careful, & persistent in our work. \n- Respect: We strive to bring value to every business relationship. \n\nThese values guide our actions & our planning as we grow business to include new opportunities. We measure our success by our ability to build & maintain strong, mutually profitable relationships with our customers, suppliers, employees & stakeholders.",
    "employeeCount": 174,
    "id": "bamberger-polymers",
    "industry": "Plastics Manufacturing",
    "name": "Bamberger Polymers",
    "searchQueries": ["Tea importers and distributors in Germany"],
    "url": "http://www.bambergerpolymers.com"
  },
  {
    "address": null,
    "ava": "https://media.licdn.com/dms/image/C4E0BAQGpICx-8deo7g/company-logo_200_200/0/1630589518722/indexbox_marketing_logo?e=2147483647&v=beta&t=apKYijL8BtsJ26TDm5658q--LbzkNNPiU0zSmoRtye0",
    "country": "Luxembourg",
    "description": "IndexBox is an AI-driven market intelligence platform.\n\nThousands of companies of all sizes — from startups to Fortune 500s — use the IndexBox Platform to get accurate market data, find new customers, and manage their supply chains.",
    "employeeCount": 15,
    "id": "indexbox",
    "industry": "Market Research",
    "name": "IndexBox",
    "searchQueries": ["Tea importers and distributors in Germany"],
    "url": "https://www.indexbox.io"
  },
  {
    "address": null,
    "ava": "https://media.licdn.com/dms/image/D4D0BAQHiGFZuRpXUJw/company-logo_200_200/0/1682400962535/international_bulk_wine_and_spirits_show_logo?e=2147483647&v=beta&t=zryns5OQLjednfq6k3O_9qnh4jQawZa8mEPOacwqyec",
    "country": "United States",
    "description": "The International Bulk Wine and Spirits Show (IBWSS) aims to gather suppliers & buyers of bulk wine/spirits, private label, contract distilling/brewing, contract winemaking from all over the world. It is an annual trade show and conference, open to trade professionals only, which takes place in San Francisco, CA. \n\n● Who can exhibit at IBWSS SF 2024?\n- Wineries and Distilleries looking to sell bulk wine/ spirits.\n- Producers, suppliers, and negociants who offer contract manufacturing / private label programs.\n- Importers/ Wineries/ Distilleries who have one-time excess stock to clear.\n- Grape Growers/ Vintners Associations & Custom crush service providers.\n- Bulk Logistics Partners, Contract Bottlers and Wine/ Spirits bottle label Designers.\n\n\n● Who can attend the show?\n- Wineries and Distilleries looking to meet up their demand.\n- Importers, Retailers, and Distributors looking for private label programs.\n- Negociants who are looking to meet the growers and producers from all over the world.",
    "employeeCount": 9,
    "id": "international-bulk-wine-and-spirits-show",
    "industry": "Beverage Manufacturing",
    "name": "International Bulk Wine & Spirits Show",
    "searchQueries": ["Tea importers and distributors in Germany"],
    "url": "https://ibwsshow.com/"
  },
  {
    "address": "5, Route de Garingail",
    "ava": "https://media.licdn.com/dms/image/D4E0BAQFiiYgR4i2wuA/company-logo_200_200/0/1689250955603/webster_barnes_logo?e=2147483647&v=beta&t=PWi04mXxwIy5bobim3ZVF7aNBcMXOs1QdjC27gSvm3U",
    "country": "France",
    "description": "Webster Barnes is a wine, spirits, and beer supplier with offices in France and the U.S. \n\nWe have worked diligently to cultivate exclusive relationships with some of the highest quality wine, beer, and spirits producers worldwide. \nWe work directly with producers in 6 continents, allowing us unfettered access to an incredibly wide range of product options: providing our clients the best prices for their products by circumventing agents and middlemen.\n\nFrom first growth and grand cru Bordeaux and Burgundy to Japanese sake breweries, from ready to drink cocktails to aromatized sparkling wine in almost any flavor imaginable, from the best quality to price-ratio wine in any hemisphere to monks brewing beer in the same Belgian Abbey for hundreds of years and everything in between, there is virtually nothing that we can’t find for you. Mendoza to Montrachet, Prague to Perth, Chianti to Cape Town, Sancerre to Sauternes – we’ve got it covered.\n\nWe are importers, consultants, market experts, artists and brand promoters that provide custom solutions and a full range of support services from conception to sales and consumer training. Our business model is collaborative, and we treat our suppliers and distributors as partners, allowing us to forge solid relationships spanning both time and distance.\n\nWe are a team with more than 50 years collective experience in the adult beverage field, offering us a unique perspective that provides the ability to expertly find solutions for all of your project needs, no matter the package contents or its retail price.\n",
    "employeeCount": 8,
    "id": "webster-barnes",
    "industry": "Beverage Manufacturing",
    "name": "Webster Barnes",
    "searchQueries": ["Tea importers and distributors in Germany"],
    "url": "http://www.websterbarnes.com"
  },
  {
    "address": "14100 Palmetto Frontage Rd",
    "ava": "https://media.licdn.com/dms/image/C4D0BAQEQPOj-DAh_KQ/company-logo_200_200/0/1631360296501?e=2147483647&v=beta&t=KdgYgHQo536uSTw9TQ-dzbaHVC1JsPgCzvgNnk03gww",
    "country": "United States",
    "description": "• Electronic entry processing (ABI)\r\n• Remote location filing (RLF) capabilities\r\n• 9802/807 specialist (Wearing apparel and other related commodities)\r\n• Duty drawback services\r\n• Importer security filing (ISF 10+2)\r\n• Other government agency assistance (FDA, USDA, FWS, etc.)\r\n• FDA filings, prior notice, releases, detention and export/destruction coordination.\r\n• Customs bonds (continuous / single entry)\r\n• Tariff classification service / Duty tariff advisories\r\n• Binding ruling requests for your commodities \r\n• Quota entries\r\n• Temporary Importation Bonds (TIB) \r\n• Special trade programs\r\n• Automated clearing house (ACH) payments direct to Customs\r\n• Local and nationwide deliveries for loose freight and container movements \r\n• Full import insurance coverage services",
    "employeeCount": 4,
    "id": "folgueras-customs-broker-corp.",
    "industry": "Transportation, Logistics, Supply Chain and Storage",
    "name": "Folgueras Customs Broker Corp.",
    "searchQueries": ["Tea importers and distributors in Germany"],
    "url": "http://www.folguerascb.com"
  },
  {
    "address": "Unit 6. High Carr Business Park",
    "ava": "https://media.licdn.com/dms/image/C560BAQFTGLEWbi-GcA/company-logo_200_200/0/1631392310164?e=2147483647&v=beta&t=Vg4cf_aGtL2R2Hx3XvUYtxHqm9LRO-o4HKvR49oIQBQ",
    "country": "United Kingdom",
    "description": "IPS Ceramics is a renowned supplier of kiln furniture and technical ceramics. We serve all industries, including tableware, sanitaryware, battery manufacturing, investment casting, technology development, laboratory research and more.\n\nWe offer cordierite, alumina, aluminium nitride, mullite, silicon carbide, silicon nitride, steatite, zirconia and more. Our products can be customised to fit your requirements and our design team allows us to produce completely bespoke products. We have a long history of developing new products for modern industries, like our recent work with the EV battery industry designing saggars for cathode powder production and module systems for firing battery components, amongst other products.\n\nFor more information on our ranges and what we offer, see www.ipsceramics.com. To contact us, please feel free to email enq@ipsceramics.com.",
    "employeeCount": 13,
    "id": "ips-ceramics-ltd",
    "industry": "Glass, Ceramics and Concrete Manufacturing",
    "name": "IPS Ceramics Ltd",
    "searchQueries": ["Tea importers and distributors in Germany"],
    "url": "http://www.ipsceramics.com"
  },
  {
    "address": "Pennsylvania Ave, NW",
    "ava": "https://media.licdn.com/dms/image/C4D0BAQFowO__Th638A/company-logo_200_200/0/1630501251547/equal_origins_logo?e=2147483647&v=beta&t=pK3juYu4WvtyBbfnRF91DZY5CsId9v8FoEmVOm7oj2A",
    "country": "United States",
    "description": "Equal Origins (formerly The Partnership for Gender Equity) works to advance gender equity in agriculture with a focus on coffee and cocoa. Our tools and approach support industry engagement and investment in gender equity across the value chain. Our evidence-based approach comprises three core elements: a validated set of tools, a common language for gender equity and a platform for action that supports scalable investments and action across the sector. By harnessing the power of collective action within the industry, growers, buyers, exporters, importers, roasters, private foundations, development agencies, academic institutions and more, PGE endeavors to drive positive impact from community to cup, and for every step in between. \n",
    "employeeCount": 7,
    "id": "equal-origins",
    "industry": "International Trade and Development",
    "name": "Equal Origins (The Partnership for Gender Equity)",
    "searchQueries": [
      "Tea importers and distributors in Germany",
      "Coffee trade companies in Europe",
      "Coffee importers in Europe",
      "Sustainable coffee sourcing companies in Germany",
      "Coffee exporters from Germany",
      "Importers of coffee in Germany",
      "Coffee industry associations in Germany",
      "Coffee importers in Germany",
      "European coffee market companies",
      "Specialty coffee roasters in Germany",
      "European coffee exporters",
      "Sustainable coffee initiatives in Germany",
      "German coffee industry associations and organizations"
    ],
    "url": "http://www.equalorigins.org"
  },
  {
    "address": "El Geish Road",
    "ava": "https://media.licdn.com/dms/image/D4D0BAQGrZg-rJTvaKQ/company-logo_200_200/0/1692820426970?e=2147483647&v=beta&t=Ce2WIvsLMEeGH_p0wAn1v_2soSgnC7AvAiAvH4E11Pc",
    "country": "Egypt",
    "description": "Welcome to ATAG - Your Gateway to Textile Machinery Excellence! 🌐\n\nAt ATAG, we take pride in our role as the trusted bridge between the world-class suppliers of textile spinning machinery and the dynamic markets of Egypt and the GCC. With over 30 suppliers in our network, our agency facilitates seamless connections, enabling our clients to access cutting-edge technology and top-notch spare parts.\n\nServices:\n🔌 Supplier Representation: We bring the best of German textile innovation to your doorstep, catering to the unique needs of the Egyptian and GCC markets.\n\n📦 Machinery Sourcing: Looking for specific spinning machinery or spare parts? Count on us to connect you with the right suppliers.\n\n🛠️ Technical Support: Our expert team ensures smooth installations, maintenance, and technical assistance for all our represented products.\n\nWhy Choose ATAG?\n- Trusted Intermediary: We are your reliable link to the latest in textile spinning technology from Germany.\n\n- Localized Expertise: Our understanding of local markets empowers us to match products with precise needs.\n\n- Market Expansion: Collaborate with us to explore untapped opportunities in the ever-evolving textile industry.",
    "employeeCount": 4,
    "id": "atag-egy",
    "industry": "Textile Manufacturing",
    "name": "ATAG Egy",
    "searchQueries": ["Tea importers and distributors in Germany"],
    "url": null
  },
  {
    "address": "Königsberger Str. 100",
    "ava": "https://media.licdn.com/dms/image/C4D0BAQHzZTNR8TMEXA/company-logo_200_200/0/1630571279295/curt_maria_medical_gmbh_logo?e=2147483647&v=beta&t=lqlSixPE-YIFG7THscTwtdo7e9RkASoeq5fyYdCUPao",
    "country": "Germany",
    "description": "Curt Maria Medical GmbH produces certified medical products in Germany according to MPG. We produce up to 15 million medical face masks per month on our fully automated production lines. All our products are certified according to the European standards EN14683:2019 in the types I/II/II R. \n\nDue to the Corona Pandemic, the demand for medical consumables has increased dramatically worldwide. The scarcity of the coveted raw materials and a proliferation of manufacturers and importers have turned the rules of the medical market upside down. Not every imported product can be fully trusted. Curt Maria Medical GmbH stands for the establishment of a reliable, high-quality volume production of medical products in Germany.",
    "employeeCount": 2,
    "id": "curt-maria-medical-gmbh",
    "industry": "Medical Equipment Manufacturing",
    "name": "Curt Maria Medical GmbH",
    "searchQueries": ["Tea importers and distributors in Germany"],
    "url": "https://www.curtmaria.de/"
  }
]
